[ 
  
  {
    "page": 1,
    "header": "Why SOAP",
    "subheader": "How I came to use SOAP in my daily journey",
    "paragraphs": [
      {
        "id": 1,
        "title": "My Past",
        "text": [
          "I came to be a Christian around the mid-point in what the western ",
          "world would consider our lifespan.  I was around 50 years old.  I ",
          "was raised as a Roman Catholic, but always felt that something was ",
          "missing.  In April of 2008, my youngest son approached me one Sunday ",
          "morning to attend a local Baptist church where his good friend's ",
          "father was the pastor.  Now I worked under contract to the U.S. Air ",
          "Force in South Korea and Sunday was a time for me to rest up, but I felt compelled ",
          "to join him and walk the mile or so to the church service.  That ",
          "simple decision changed the way I am.  I was confused by the music ",
          "and structure of the service, but the one thing that stuck out was ",
          "a call at the end of the service for those who hadn't accepted ",
          "Christ as their personal savior.  We were to have our head down and ",
          "eyes closed, but to raise our hand so that the pastor and elders ",
          "could talk to us after and pray for us.  After the service, one of ",
          "the elders approached me and told me to read the Bible and to talk ",
          "to him or one of the others for assistance.  He said I needed to ",
          "surrender to the Lord and be saved.  This was like a foreign ",
          "language to me, but I went to the local base's bookstore and bought ",
          "a Bible that day.  It took nearly a year for me to surrender and ",
          "be accepted by Christ, receiving the Holy Spirit in the process."
        ]
      },{
        "id": 2,
        "title": "My Personal Journey Starts",
        "text": [
          "That first excursion into the Bible was daunting, to say the least. ",
          "I had no foreknowledge and didn't even know what I should study.  I ",
          "had no plan, so I decided to read it cover-to-cover.  Along the way ",
          "I received help from fellow workers, the elders at the church and ",
          "unknowingly from the Lord Himself.  I fought the idea of surrender. ",
          "Anyone who was a soldier, sailor, marine or airman has been instilled ",
          "with the idea that we never surrender if we have the mean to defend ",
          "ourselves.  It wasn't until I realized that this was meant for an ",
          "enemy, not God.  I was asked to surrender to a friend, not an enemy ",
          "and this tipped the balance.  I surrendered and felt the Holy Spirit ",
          "in my life from that moment on.  I still had a problem though.  I ",
          "still didn't know how to study the Bible to receive the Word of God. ",
          "I took college courses on the Bible from a seminary on-line course. ",
          "I went to Sunday morning Bible study courses at my church.  I even ",
          "was the guide to one.  But none of these methods brought me closer ",
          "to discipleship I yearned for.  Then one day, my best friend ",
          "introduced me to a book he was reading called 'Divine Mentor' by ",
          "Wayne Cordeiro.  The back of the book describes Wayne as the ",
          "founding pastor of New Hope Christian Fellowship in Oahu, Hawaii and ",
          "my friend had attended that church while he was living there.  I ",
          "bought an electronic version of the book and hesitantly started to ",
          "read it. "
        ]
      },{
        "id": 3,
        "title":  "Boosted toward Discipleship",
        "text": [
          "Several weeks went by while both of us read the book where Wayne ",
          "talks about God being the ultimate teacher, 'The Divine Mentor.' ",
          "I was just about through the book, when my friend, our spouses and ",
          "I were on a train to go see a hockey game several cities away.  He ",
          "and I were discussing the book when I told my friend we should follow the ",
          "study method describe in the book (SOAP).  He agreed and we have ",
          "been using this method ever since.  I will get into this in a later ",
          "portion of this help.  I have read the entire Bible many times over ",
          "and learn and apply new things all the time.  He and I are now much ",
          "farther along the path to discipleship than we were then and I ",
          "attribute this to SOAP."
        ]
      }
    ]
  },{
    "page": 2,
    "header": "5 Things For Life",
    "subheader": "(paraphrasing Divine Mentor by Wayne Cordeiro)",
    "paragraphs": [
      {
        "id": 1,
        "title": "Introduction",
        "text": [
          "Wayne Cordeiro was pastor as New Hope Church in Oahu, Hawaii and for many ",
          "years he found that people struggled with their faith in profound ways.  ",
          "They needed help but didn't know where to turn.  He, himself, found ",
          "solice in his daily devotional routine and over time developed the SOAP ",
          "method of learning and applying God's Word to our lives.  I myself was ",
          "introduced to Wayne through his book, Devine Mentor.  I highly recommend ",
          "reading it. SOAP stands for Scripture, Observation, Application and ",
          "prayer.  I'd actually recommend PSOAP by bracketing the Scripture, ",
          "Observation and Application by prayer, both before and after.  He ",
          "stated that he struggle during his early ministry, but the one thing ",
          "that kept him straight was a daily devotional.  His simple method ",
          "required five things:"
        ], 
        "bullets": [
          { "id": 1, "text": "A Bible" },
          { "id": 2, "text": "A pen" },
          { "id": 3, "text": "A journal or notebook" },
          { "id": 4, "text": "A Bible reading plan" },
          { "id": 5, "text": "A daily planner" }
        ]
      },
      {
        "id": 2,
        "title": "A Bible",
        "text": [
          "To study God's word, we need to get it from the source and the only ",
          "written and approved source of God's word in the Bible.  In 2 Tim 3:16-17, ",
          "Paul wrote, 'All Scripture is given by inspiration of God, and is ",
          "profitable for doctrine, for reproof, for correction, for instruction ",
          "in righteousness, that the man of God may be complete, thoroughly ",
          "equipped for every good work.'(NKJV)  The bible is the primary way ",
          "God speaks to us, so shouldn't we use it.  If we don't, aren't we ",
          "ripe for going off track.  The bible is the reference point that ",
          "keeps us on the straight and narrow path.  Of course the other is ",
          "God himself in the form of the Holy Spirit."
        ]
      },
      {
        "id": 3,
        "title": "A pen",
        "text": [
          "Wayne Cordeiro says, 'Bring a pen with you.  Why?  So you can mark up ",
          "your Bible.' We need to remember that the Bible in front of you isn't ",
          "holy, only the Word or truths within it are.  So marking in margins, ",
          "underlining, and other marks are okay.  An important note is that ",
          "this program is really led by the Holy Spirit.  You never should ",
          "anticipate, nor should you ignore His prompting.  A nudge, up to and ",
          "including a loss of focus could indicate the Spirit is wanting you ",
          "to notice a particular passage.  Put a dot, underline it, whatever ",
          "gets your attention later, is important.  I personally use a bible ",
          "highlighter to place a quick dot at the passage or beginning of a ",
          "verse, otherwise I may not find it later and remember what the Spirit ",
          "was telling me earlier."
        ]
      },
      {
        "id": 4,
        "title": "A journal",
        "text": [
          "A journal is a notebook where you write down what God is saying to ",
          "you.  That is was journalling is, 'Write it down'.  It is not a ",
          "place for random thoughts. This is a structure output used to ",
          "enrich your faith. You may be thinking, I don't need to take notes ",
          "to study the bible; but I think you're wrong.  Taking notes helps us ",
          "to delve deeper with the Spirit as our guide.  I can remember a ",
          "passage jumping out at me.  I didn't know what to write, so I let ",
          " the Spirit take over.  He guided my pen to one of the best set of ",
          "observations and application I have written down. Also, a part of the ",
          "program is sharing what we've learned with others.  So, writing is ",
          "necessary to share what you've written and learned."
        ]
      },
      {
        "id": 5,
        "title": "A Bible reading plan",
        "text": [
          "When you take a trip to a place known or unknown, it is best to have ",
          "a plan or map to take with you to ensure you get to the right place. ",
          "A Bible reading plan is this map for your journey through the Bible. ",
          "The one I use and is provided in this application guides you through ",
          "the entire bible in one year or 365 days.  It was copied from 'Divine ",
          "Mentor' and is a good plan in that you will read the entire Old ",
          "Testament once, and the New Testament twice.  There are many plans ",
          "out on the Internet, but pick one from a reputible source.  I think ",
          "the plan provide is a good one and I recommend it.  You should aim to ",
          "read the entire bible, not just the portions you feel are pertinent. ",
          "The Bible is the inspired Word of God, so He must have provided it to ",
          "each of us for a reason."
        ]
      },
      {
        "id": 6,
        "title": "A daily planner",
        "text": [
          "You may think this is a wierd thing to include while trying getting ",
          "into studying the Bible.  Let me give you an example:  You sit down ",
          "in a private room, get your Bible, plan, pen and journal ready for ",
          "doing the lesson of the day.  You pray to the Holy Spirit to guide ",
          "your thoughts and help you in this study, then 5 minutes later you ",
          "remember you need to go to the grocery store to pick up dinner.  The ",
          "daily planner is there to write down this event and need, so that ",
          "you can go back to the study without the distraction on your mind. ",
          "This in-turn helps you to hear the Holy Spirit's prompting to focus ",
          "on a particular verse or verses."
        ]
      }
    ]
  },
  {
    "page": 3,
    "header": "SOAP Explained",
    "subheader": "(paraphrasing Divine Mentor by Wayne Cordeiro)",
    "paragraphs": [
    ]
  },
  {
    "page": 4,
    "header": "20/20/20 Method",
    "subheader": "(paraphrasing Divine Mentor by Wayne Cordeiro)",
    "paragraphs": [
    ]
  },
  {
    "page": 4,
    "header": "20/20/20 Method",
    "subheader": "(paraphrasing Divine Mentor by Wayne Cordeiro)",
    "paragraphs": [
    ]
  }
]