[ 
  
  {
    "page": 1,
    "header": "Why SOAP",
    "subheader": "How I came to use SOAP in my daily journey",
    "paragraphs": [
      {
        "id": 1,
        "title": "My Past",
        "text": [
          "I came to be a Christian around the mid-point in what the western ",
          "world would consider our lifespan.  I was around 50 years old.  I ",
          "was raised as a Roman Catholic, but always felt that something was ",
          "missing.  In April of 2008, my youngest son approached me one Sunday ",
          "morning to attend a local Baptist church where his good friend's ",
          "father was the pastor.  Now I worked under contract to the U.S. Air ",
          "Force in South Korea and Sunday was my time to rest up, but I felt compelled ",
          "to join him and walked the mile or so to the church service.  That ",
          "simple decision changed the way I am.  I was confused by the music ",
          "and structure of the service (nothing like a Catholic service), ", 
          "but the one thing that stuck me was ",
          "a call at the end of the service for those who hadn't accepted ",
          "Christ as their personal savior.  We were told to have our head down and ",
          "eyes closed, but to raise our hand so that the pastor and elders ",
          "could talk to us after and pray for us.  After the service, one of ",
          "the elders approached me and told me to read the Bible and to talk ",
          "to him or one of the others for assistance.  He said I needed to ",
          "surrender to the Lord and be saved.  This was like a foreign ",
          "language to me, but I went to the local base's bookstore and bought ",
          "a Bible that same day.  It took nearly a year for me to surrender and ",
          "be accepted by Christ, receiving the Holy Spirit in the process."
        ]
      },{
        "id": 2,
        "title": "My Personal Journey Starts",
        "text": [
          "That first excursion into the Bible was daunting, to say the least. ",
          "I had no foreknowledge and didn't even know what I should study.  I ",
          "had no plan, so I decided to read it cover-to-cover.  Along the way ",
          "I received help from fellow workers, the elders at the church and ",
          "unknowingly from the Lord Himself.  I fought the idea of surrender. ",
          "Anyone who was a soldier, sailor, marine or airman has been instilled ",
          "with the idea that we never surrender, if we have the mean to defend ",
          "ourselves.  It wasn't until I realized that this was meant for an ",
          "enemy, not God.  I was asked to surrender to a friend, not an enemy ",
          "and this tipped the balance.  I surrendered and felt the Holy Spirit ",
          "in my life from that moment on.  I still had a problem though.  I ",
          "still didn't know how to study the Bible to receive the Word of God. ",
          "I took college courses on the Bible from a seminary on-line course. ",
          "I went to Sunday morning Bible study courses at my church.  I even ",
          "was the guide to one study.  But none of these methods brought me closer ",
          "to the discipleship I yearned for.  Then one day, my best friend ",
          "introduced me to a book he was reading called 'Divine Mentor' by ",
          "Wayne Cordeiro.  The back of the book describes Wayne as the ",
          "founding pastor of New Hope Christian Fellowship in Oahu, Hawaii and ",
          "my friend had attended that church while he was living there.  I ",
          "bought an electronic version of the book and hesitantly started to ",
          "read it. "
        ]
      },{
        "id": 3,
        "title":  "Boosted toward Discipleship",
        "text": [
          "Several weeks went by while both of us read the book. Wayne ",
          "talked about God being the ultimate teacher, 'The Divine Mentor.' ",
          "I was just about through the book, when my friend, our spouses and ",
          "I were on a train to go see a hockey game several cities away.  He ",
          "and I were discussing the book when I told my friend we should follow the ",
          "study method describe in the book (SOAP).  He agreed and we have ",
          "been using this method ever since.  I will get into this more in a later ",
          "portion of this help.  I have read the entire Bible many times over ",
          "and learn and apply new things all the time.  He and I are now much ",
          "farther along the path to discipleship than we were then and I ",
          "attribute this to SOAP."
        ]
      }
    ]
  },{
    "page": 2,
    "header": "5 Things For Life",
    "subheader": "(paraphrasing Divine Mentor by Wayne Cordeiro)",
    "paragraphs": [
      {
        "id": 1,
        "title": "Introduction",
        "text": [
          "Wayne Cordeiro was pastor as New Hope Church in Oahu, Hawaii and for many ",
          "years he found that people struggled with their faith in profound ways.  ",
          "They needed help but didn't know where to turn.  He, himself, found ",
          "solice in his daily devotional routine and over time developed the SOAP ",
          "method of learning and applying God's Word to our lives.  I myself was ",
          "introduced to Wayne through his book, 'Devine Mentor'.  I highly recommend ",
          "reading it. SOAP stands for Scripture, Observation, Application and ",
          "prayer.  I'd actually recommend PSOAP by bracketing the Scripture, ",
          "Observation and Application by prayer, both before and after.  He ",
          "stated that he struggle during his early ministry, but the one thing ",
          "that kept him straight was a daily devotional.  This simple method ",
          "requires five things:"
        ], 
        "bullets": [
          { "id": 1, "text": "A Bible" },
          { "id": 2, "text": "A pen" },
          { "id": 3, "text": "A journal or notebook" },
          { "id": 4, "text": "A Bible reading plan" },
          { "id": 5, "text": "A daily planner" }
        ]
      },
      {
        "id": 2,
        "title": "A Bible",
        "text": [
          "To study God's word, we need to get it from the source and the only ",
          "written and approved source of God's word is the Bible.  In 2 Tim 3:16-17, ",
          "Paul wrote, 'All Scripture is given by inspiration of God, and is ",
          "profitable for doctrine, for reproof, for correction, for instruction ",
          "in righteousness, that the man of God may be complete, thoroughly ",
          "equipped for every good work.'(NKJV)  The bible is the primary way ",
          "God speaks to us, so shouldn't we use it.  If we don't, aren't we ",
          "ripe for going off track.  The bible is the reference point that ",
          "keeps us on the straight and narrow path.  Of course the other is ",
          "God himself in the form of the Holy Spirit."
        ]
      },
      {
        "id": 3,
        "title": "A pen",
        "text": [
          "Wayne Cordeiro says, 'Bring a pen with you.  Why?  So you can mark up ",
          "your Bible.' We need to remember that the Bible, in front of you, isn't ",
          "holy, only the Word or truths within it are.  So marking in margins, ",
          "underlining, and other marks are okay.  An important note is that ",
          "this program is really led by the Holy Spirit.  You never should ",
          "anticipate, nor should you ignore His prompting.  A nudge, up to and ",
          "including a loss of focus could indicate the Spirit is wanting you ",
          "to notice a particular passage.  Put a dot, underline it, whatever ",
          "gets your attention later, it's important.  I personally use a bible ",
          "highlighter to place a quick dot at the passage or beginning of a ",
          "verse, otherwise I may not find it later and remember what the Spirit ",
          "was telling me earlier."
        ]
      },
      {
        "id": 4,
        "title": "A journal",
        "text": [
          "A journal is a notebook where you write down what God is saying to ",
          "you.  That is what journalling is, 'Write it down'.  It is not a ",
          "place for random thoughts. This is a structured output used to ",
          "enrich your faith. You may be thinking, I don't need to take notes ",
          "to study the bible; but I think you're wrong.  Taking notes helps us ",
          "to delve deeper with the Spirit as our guide.  I can remember a ",
          "passage jumping out at me.  I didn't know what to write, so I let ",
          " the Spirit take over.  He guided my pen to one of the best set of ",
          "observations and application I have ever written down. Also, a part of the ",
          "program is sharing what we've learned with others.  So, writing is ",
          "necessary to share what you've written and learned."
        ]
      },
      {
        "id": 5,
        "title": "A Bible reading plan",
        "text": [
          "When you take a trip to a place known or unknown, it's best to have ",
          "a plan or map to take with you to ensure you get to the right place. ",
          "A Bible reading plan is this map for your journey through the Bible. ",
          "The one I use, and is provided in this application, guides you through ",
          "the entire bible in one year or 365 days.  It was copied from 'Divine ",
          "Mentor' and is a good plan in that you will read the entire Old ",
          "Testament once, and the New Testament twice.  There are many plans ",
          "out on the Internet, but pick one from a reputible source.  I think ",
          "this plan is a good one and I recommend it.  You should aim to ",
          "read the entire bible, not just the portions you feel are pertinent. ",
          "The Bible is the inspired Word of God, so He must have provided it to ",
          "each of us for a reason."
        ]
      },
      {
        "id": 6,
        "title": "A daily planner",
        "text": [
          "You may think this is a wierd thing to include while trying getting ",
          "into studying the Bible.  Let me give you an example:  You sit down ",
          "in a private room, get your Bible, plan, pen and journal ready for ",
          "doing the lesson of the day.  You pray to the Holy Spirit to guide ",
          "your thoughts and help you in this study, then 5 minutes later you ",
          "remember you need to go to the grocery store to pick up dinner.  The ",
          "daily planner is there to write down this event and need, so that ",
          "you can go back to the study without the distraction on your mind. ",
          "This in-turn helps you to hear the Holy Spirit's prompting to focus ",
          "on a particular verse or verses."
        ]
      }
    ]
  },
  {
    "page": 3,
    "header": "SOAP Explained",
    "subheader": "(paraphrasing Divine Mentor by Wayne Cordeiro)",
    "paragraphs": [
      {
        "id": 1,
        "title": "The Acronym",
        "text": [
          "If you've been associated with the military in any way, you quickly ",
          "realized that they sometimes speak in a language similar to English ",
          "but full of these words that aren't really words, they're acronyms. ",
          "SOAP is an acronym that stands for Scripture, Observation, ",
          "Application, and Prayer.  The whole idea of SOAP is to allow you to ",
          "appreciate and build your communication ability with God, especially ",
          "the Holy Spirit. I will describe the four parts next, individually."
        ]
      },
      {
        "id": 2,
        "title": "Scripture",
        "text": [
          "As I stated earlier, the Bible is the inspired Word of God and your ",
          "reading plan has you reading it three-five chapters at a time. This ",
          "will provide the scripture passage you have chosen or are prompted to ",
          "write about.  Earlier I also told you to mark verses while you are ",
          "reading.  If you did this and have several dots or underlined passages ",
          "you will have to decide which to write about.  Normally, you will ",
          "start with the location the verse(s) was found.  Book chapter:verse(s) ",
          "is a good form to use, then a dash (-).  Next, type in the verse(s) ",
          "in their entirety.  Write or type it in, don't cut and paste.  This ",
          "gives you an opportunity to look closer at the verse. If you are ",
          "using one of the reading plans provided by this program, the entry ",
          "area includes links to the Blue Letter Bible Organization's web pages ",
          "for each book, chapter, and verses.  This is a great tool because you ",
          "can reference the web page's tools for translation and further study, ",
          "if you are so inclined.  I've taken the time, with some passages to ",
          "add my own interpretation of the passage using the web page's ",
          "Interlinear tool and Strongs Concordance.  It will help in making a ",
          "word for word translation of the orginal language to help you in ",
          "understanding the Word."
        ]
      },
      {
        "id": 3,
        "title": "Observations",
        "text": [
          "I've already talked about the Holy Spirit's essential part in studying ",
          "the Bible and this section is where we record our notes, feelings and ",
          "other things associated with the passage.  It can be hard to start, ",
          "so a tip here is just to ramble a little and write whatever comes to ",
          "mind, because this may be, and probably is, the Holy Spirit at work ",
          "within you.  I usually stop writing when I run out of thoughts."
        ]
      },
      {
        "id": 4,
        "title": "Application",
        "text": [
          "Now we need to apply the passage and observations into an action plan ",
          "for our own life.  I tend to apply it to a fictional group, as we, ",
          "instead of I, but the action is the same.  You need to write this as ",
          "a definitive plan, not some fictional scene that may or may not ",
          "happen.  Remember this study is about learning for real life, so ",
          "actions within your own life is necessary.  It is probably something ",
          "you've already thought about or put into action anyway."
        ]
      },
      {
        "id": 5,
        "title": "Prayer",
        "text": [
          "The last part is prayer.  You've probably already asked the Lord to ",
          "change your life in this way, but it is best to get it down in writing. ",
          "My friend and I don't share our prayers, when we share our writings ",
          "but this communication is between you and God.  It is said that God ",
          "already knows our prayers, but write this prayer down, so you truly ",
          "see that prayer can work and you know that you are going to get the ",
          "help God gives to all believers."
        ]
      }
    ]
  },
  {
    "page": 4,
    "header": "20/20/20 Method",
    "subheader": "(paraphrasing Divine Mentor by Wayne Cordeiro)",
    "paragraphs": [
      {
        "id": 1,
        "title": "Giving Time to God",
        "text": [
          "You will spend approximately 60 minutes each session.  You may think ",
          "that this is a lot of time, but don't you have 60 minutes for God. ",
          "My normal day consists of 8 hours of sleep, 30 minutes before work, ",
          "8 hours of work, and 60 minutes of eating, so I decided I could spend ",
          "60 minutes for God. Guilt seems to play a part in this discussion and ",
          "if you have young kids, you probably want to spend time with them. ",
          "See if there is some other aspect of your daily routine you could ",
          "cut back on (like watching television) and give the time to God."
        ]
      },
      {
        "id": 2,
        "title": "A Group Session",
        "text": [
          "SOAP was developed as both an individual and group action.  As an ",
          "individual, SOAP is about getting closer to God and Him teaching you ",
          "how to deal with events in your life.  As a group, it is about teaching ",
          "and helping others get closer.  My friend and I were at the same ",
          "point in our discipleship journey, so there was no teacher/student ",
          "relationship, and I think this was good.  We were able to teach each ",
          "other what the Holy Spirit taught each of us individually.  In the ",
          "group setting, you will take 20 minutes to read the scriptures, 20 ",
          "minutes to write about it, and 20 minutes to share what you've ",
          "learned by sharing what you wrote.  As an individual, you will do the ",
          "first two 20-minute periods."
        ]
      },
      {
        "id": 3,
        "title": "The Location",
        "text": [
          "Each of us is different.  You need to be able to hear and listen to ",
          "the Holy Spirit.  I personally am able to tune out distractions ",
          "around me, mostly, so I can study at a resturant, a room alone, even ",
          "at a busy airport.  Others may need a quiet environment of a room ",
          "alone, a chapel, or a library.  I find that doing the study in a ",
          "public place allows me to talk to people about Christ, studying the ",
          "Bible and the SOAP method.  You need to pick a location suited to ",
          "your needs.  When my friend and I started this, we met weekly at a ",
          "local fast food resturant.  We got our food, dumped the fries in the ",
          "middle, prayed for the meal and study, then started to do the reading ",
          "and writing.  We had a few people come up to see what we were doing ",
          "and one who joined for a few months."
        ]
      },
      {
        "id": 4,
        "title": "The Time",
        "text": [
          "The 20 minutes of reading and 20 minutes of writing are individualized. ",
          "Even in the group setting, there is no need, nor should there be a ",
          "desire, to talk and share.  Sit and read the plan slowly and with an ",
          "ear open to the Lord.  Mark in the Bible the passages His Spirit ",
          "points out to you.  Don't stop and start writing before you've read ",
          "it all.  After finishing the reading, decide which verse or verses ",
          "you need to write about.  It may take further research, take the time ",
          "as this is about growth and your ability to hear the Holy Spirit. ",
          "Then, take about 20 minutes to write.  Write in the scripture, your ",
          "observations, and application.  Somewhere in this you'll probably ",
          "decide on a title, write it down as it comes to you, but decide on ",
          "one no longer than after writing down your application.  Lastly, ",
          "write out the prayer to ask God to help you with your application.",
          "The last 20-minute period is for sharing what you've written.  My ",
          "friend and I still share our work, even though we're thousands of ",
          "miles apart (He's currently in Hawaii and I'm in South Korea).  When ",
          "this happens, once a week we meet on ZOOM and share our entire week. ",
          "It takes two session, back-to-back, but we get it done.  We take a ",
          "little time to discuss how God is working in our lives besides.  Get ",
          "creative as your time permits."
        ]
      }
    ]
  },
  {
    "page": 5,
    "header": "This Application",
    "subheader": "",
    "paragraphs": [
      {
        "id": 1,
        "title": "Why This App was Developed",
        "text": [
          "Quite frankly, I started developing this application because of my ",
          "writing ability.  I can write, but my penmanship is awful.  I would ",
          "sometimes have to guess at a word I wrote in the observations or ",
          "application section.  I also have about a dozen notebooks of my ",
          "SOAP entries.  So, as a web developer and software engineer, I decided ",
          "to put my talents to work and developed this app.  I hope it helps ",
          "you, but feel free to go back to pen and paper, it won't bother me ",
          "in the slightest.  Just keep at the study and grow."
        ]
      },
      {
        "id": 2,
        "title": "Next",
        "text": [
          "Since you've opened this application, you saw the log in page and ",
          "tapped on the help icon, so the next step is creating an account."
        ]
      }
    ]
  },
  {
    "page": 6,
    "header": "Creating An Account",
    "subheader": "",
    "paragraphs": [
      {
        "id": 1,
        "title": "Getting to the Create Account Screen",
        "text": [
          "Everything start with the Log In page. "
        ], 
        "bullets": [
          { "id": 1, "text": "Return to the Login Page" },
          { "id": 2, "text": "Click on the 'Create Account' button at the bottom of the login form." },
          { "id": 3, "text": "Fill in the data (all are required, except Middle Name). Ensure the email address is real and active as an email with a temporary password will be sent here." },
          { "id": 4, "text": "Click the 'Create' button to create the account.  An email will arrive shortly to the email address given." },
          { "id": 5, "text": "After creation, the web page will send you back to the Login Page." },
          { "id": 6, "text": "Look for the email and copy the temporary password." },
          { "id": 7, "text": "Type in the email address, then paste in the temporary password and Click the 'Log In' button" },
          { "id": 8, "text": "You are required to change your password immediately.  Type in the email address and a new password, plus type it in again in the verify block.  Then click 'Change'." }
        ]
      },
      {
        "id": 2,
        "title": "Account Created and Ready to Go",
        "text": [
          "If you followed the steps above, your account is ready and you're ",
          "seeing the user's entries page. ",
          "At this point you can add a new SOAP Entry, add or edit a reading plan, and/or ",
          "modify your profile, which is all the information form the creation ",
          "page, plus the ability to change your password."
        ]
      }
    ]
  }
]